Revit 2024 API
CategoryNameMap.ForwardIterator Method
Retrieve a forward moving iterator to the map.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual CategoryNameMapIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As CategoryNameMapIterator
Visual C++
public:
virtual CategoryNameMapIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the map.
See Also
CategoryNameMap Class
Autodesk.Revit.DB Namespace